## Read Data

In [1]:
import pandas as pd
#Read data
data = pd.read_csv(r'data_sample/TaxiData-Sample',header = None)
#rename the columns for the data
data.columns = ['VehicleNum', 'Stime', 'Lng', 'Lat', 'OpenStatus', 'Speed']

In [2]:
#display the first 5 rows of the data
data.head(5)

   VehicleNum     Stime         Lng        Lat  OpenStatus  Speed
0       22271  22:54:04  114.167000  22.718399           0      0
1       22271  18:26:26  114.190598  22.647800           0      4
2       22271  18:35:18  114.201401  22.649700           0      0
3       22271  16:02:46  114.233498  22.725901           0     24
4       22271  21:41:17  114.233597  22.720900           0     19

OpenStatus —— is it occupied(0 - No，1 - Yes)

## Data Processing

### data filtering

In [3]:
(data['VehicleNum']==22271).head(5)

0    True
1    True
2    True
3    True
4    True
Name: VehicleNum, dtype: bool

In [4]:
#Get all data with license plate 22271
data[data['VehicleNum']==22271].head(5)

   VehicleNum     Stime         Lng        Lat  OpenStatus  Speed
0       22271  22:54:04  114.167000  22.718399           0      0
1       22271  18:26:26  114.190598  22.647800           0      4
2       22271  18:35:18  114.201401  22.649700           0      0
3       22271  16:02:46  114.233498  22.725901           0     24
4       22271  21:41:17  114.233597  22.720900           0     19

In [5]:
#Delete data with license plate 22271
data[-(data['VehicleNum']==22271)].head(5)

      VehicleNum     Stime         Lng        Lat  OpenStatus  Speed
1437       35807  01:53:46  113.809898  22.626801           0      0
1438       35807  01:43:46  113.813301  22.623600           0      0
1439       35807  01:14:15  113.847000  22.594700           0     41
1440       35807  02:01:41  113.852501  22.625700           0     22
1441       35807  01:01:59  113.897003  22.551901           0     42

In [7]:
#Obtain the 'Stime' column from the data. 
data[['Stime']].head(5)

      Stime
0  22:54:04
1  18:26:26
2  18:35:18
3  16:02:46
4  21:41:17

In [8]:
#Define column 'speed1' as twice as the 'speed' column, 
data.loc[:,'Speed1']=data['Speed']*2
data.head(5)

   VehicleNum     Stime         Lng        Lat  OpenStatus  Speed  Speed1
0       22271  22:54:04  114.167000  22.718399           0      0       0
1       22271  18:26:26  114.190598  22.647800           0      4       8
2       22271  18:35:18  114.201401  22.649700           0      0       0
3       22271  16:02:46  114.233498  22.725901           0     24      48
4       22271  21:41:17  114.233597  22.720900           0     19      38

In [10]:
#Delete column 'Stime'. 
data.drop(['Stime'],axis=1).head(5)# will not affect data.

   VehicleNum         Lng        Lat  OpenStatus  Speed  Speed1
0       22271  114.167000  22.718399           0      0       0
1       22271  114.190598  22.647800           0      4       8
2       22271  114.201401  22.649700           0      0       0
3       22271  114.233498  22.725901           0     24      48
4       22271  114.233597  22.720900           0     19      38

In [11]:
#Delete column 'Stime'.
data = data.drop(['Speed1'],axis=1) #reassign to data.

### data cleaning

In [12]:
# Sort the data and reassign the sorted data to the original data
data = data.sort_values(by = ['VehicleNum','Stime'])
data.head(5)

      VehicleNum     Stime         Lng        Lat  OpenStatus  Speed
39         22271  00:00:49  114.266502  22.728201           0      0
397        22271  00:01:48  114.266502  22.728201           0      0
1413       22271  00:02:47  114.266502  22.728201           0      0
244        22271  00:03:46  114.266502  22.728201           0      0
247        22271  00:04:45  114.268898  22.729500           0     11

In [13]:
len(data)

1601307

In [17]:
#Here, clean the abnormal data mentioned above
#The conditions used are:
#1.latter row equals to the former row
#2.but the latter row and the middle row are different
#3.the license plate of latter row equals to the former row
#4.the license plate of middle row equals to the latter row

#The intersection of conditions
#data[(condition1)&(condition2)]
#The union between the conditions
#data[(condition1)|(condition2)]

#data = 
###########################################################################

data = data[-((data['OpenStatus'].shift(-1) == data['OpenStatus'].shift())&
(data['OpenStatus'].shift(-1) != data['OpenStatus'])&
(data['VehicleNum'].shift(-1) == data['VehicleNum'].shift())&
(data['VehicleNum'].shift(-1) == data['VehicleNum']))]

In [15]:
len(data)

1598866

## Identification of OD

### identify state change of passengers getting on and off

In [18]:
data.head(5)

      VehicleNum     Stime         Lng        Lat  OpenStatus  Speed
39         22271  00:00:49  114.266502  22.728201           0      0
397        22271  00:01:48  114.266502  22.728201           0      0
1413       22271  00:02:47  114.266502  22.728201           0      0
244        22271  00:03:46  114.266502  22.728201           0      0
247        22271  00:04:45  114.268898  22.729500           0     11

In [19]:
#data.loc[:,'OpenStatus1'] = 
#data.loc[:,'VehicleNum1'] = 
#data.loc[:,'Lng1'] = 
#data.loc[:,'Lat1'] = 
#data.loc[:,'Stime1'] = 

#data.loc[:,'StatusChange'] = 

#######################################################################

data.loc[:,'OpenStatus1'] = data['OpenStatus'].shift(-1)
data.loc[:,'VehicleNum1'] = data['VehicleNum'].shift(-1)
data.loc[:,'Lng1'] = data['Lng'].shift(-1)
data.loc[:,'Lat1'] = data['Lat'].shift(-1)
data.loc[:,'Stime1'] = data['Stime'].shift(-1)

data.loc[:,'StatusChange'] = data['OpenStatus1']-data['OpenStatus']

In [20]:
data.head(5)

,VehicleNum,Stime,Lng,Lat,OpenStatus,Speed,OpenStatus1,VehicleNum1,Lng1,Lat1,Stime1,StatusChange
39,22271,00:00:49,114.266502,22.728201,0,0,0.0,22271.0,114.266502,22.728201,00:01:48,0.0
397,22271,00:01:48,114.266502,22.728201,0,0,0.0,22271.0,114.266502,22.728201,00:02:47,0.0
1413,22271,00:02:47,114.266502,22.728201,0,0,0.0,22271.0,114.266502,22.728201,00:03:46,0.0
244,22271,00:03:46,114.266502,22.728201,0,0,0.0,22271.0,114.268898,22.729500,00:04:45,0.0
247,22271,00:04:45,114.268898,22.729500,0,11,0.0,22271.0,114.272003,22.731199,00:05:44,0.0

### Sort out the boarding and alighting status into OD

In [22]:
#two conditions：
#1.StatusChange is 1 or - 1
#2.the vehicle ID of this row and the next row must be the same
#data=

#######################################################################

data = data[((data['StatusChange'] == 1)|(data['StatusChange'] == -1))
&(data['VehicleNum'] == data['VehicleNum1'])]

In [23]:
data.head(5)

,VehicleNum,Stime,Lng,Lat,OpenStatus,Speed,OpenStatus1,VehicleNum1,Lng1,Lat1,Stime1,StatusChange
1548741,22334,00:00:52,114.111130,22.576750,1,13,0.0,22334.0,114.111130,22.576750,00:01:04,-1.0
1548351,22334,00:07:44,114.080498,22.554182,0,11,1.0,22334.0,114.080498,22.554182,00:07:57,1.0
1549620,22334,00:17:58,114.084915,22.540850,1,2,0.0,22334.0,114.084915,22.540850,00:18:16,-1.0
1547182,22334,00:18:56,114.084915,22.540850,0,0,1.0,22334.0,114.084915,22.540850,00:19:05,1.0
1547627,22334,00:44:47,114.056236,22.633383,1,3,0.0,22334.0,114.056236,22.633383,00:44:52,-1.0

In [24]:
#only keeps some fields we need
data = data[['VehicleNum','Stime','Lng','Lat','StatusChange']]
data.head(5)

         VehicleNum     Stime         Lng        Lat  StatusChange
1548741       22334  00:00:52  114.111130  22.576750          -1.0
1548351       22334  00:07:44  114.080498  22.554182           1.0
1549620       22334  00:17:58  114.084915  22.540850          -1.0
1547182       22334  00:18:56  114.084915  22.540850           1.0
1547627       22334  00:44:47  114.056236  22.633383          -1.0

In [25]:
data = data.rename(columns = {'Lng':'SLng','Lat':'SLat'})
data['ELng'] = data['SLng'].shift(-1)
data['ELat'] = data['SLat'].shift(-1)
data['Etime'] = data['Stime'].shift(-1)
data = data[data['StatusChange'] == 1]
data = data.drop('StatusChange',axis = 1)

In [26]:
data.head(5)

,VehicleNum,Stime,SLng,SLat,ELng,ELat,Etime
1548351,22334,00:07:44,114.080498,22.554182,114.084915,22.540850,00:17:58
1547182,22334,00:18:56,114.084915,22.540850,114.056236,22.633383,00:44:47
1547511,22334,02:38:35,114.091637,22.543200,114.093498,22.554382,02:46:52
1547789,22334,03:58:46,114.038818,22.553232,114.052299,22.604366,04:13:57
1547764,22334,06:30:11,114.031250,22.519550,114.067886,22.521299,06:41:19

In [29]:
data.to_csv(r'data_sample/taxi_OD.csv',index = None)